docs/org/docs.org
#+TITLE: Documentation
#+AUTHOR: Petros Papapanagiotou
#+EMAIL: petros@workflowfm.com
#+OPTIONS: toc:nil email:t 
#+EXCLUDE_TAGS: noexport
#+PROPERTY: header-args :results output drawer :session workflowfm :exports both :eval no-export :dir ../../
#+HUGO_AUTO_SET_LASTMOD: t

#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: docs


** Setup
   :PROPERTIES:
   :EXPORT_FILE_NAME: setup
   :EXPORT_HUGO_WEIGHT: 110
   :END:
*** Quick setup

 Clone the following repository:
 https://github.com/workflowfm/hol-light

 #+BEGIN_SRC sh :eval no
 git clone https://github.com/workflowfm/hol-light.git
 #+END_SRC

 Then make sure all the submodules are initialised and updated:
 #+BEGIN_SRC sh :eval no
 git submodule update --init --recursive
 #+END_SRC


*** Manual setup

 Assuming an existing installation of HOL Light, you can setup the reasoner manually by installing the following libraries:

 1. The [[https://bitbucket.org/petrospapapa/isabelle-light][Isabelle Light]] library. This also comes bundled with HOL Light by default.
 2. Additional [[https://github.com/PetrosPapapa/hol-light-tools][HOL Light tools]]. This consists of useful snippets of code, libraries, and theorems. This should be installed in a =tools/= directory within HOL Light.
 3. The [[https://github.com/PetrosPapapa/hol-light-embed][HOL Light embed]] library which enables reasoning with encoded logics. This should be installed in a ~embed/~ directory within HOL Light.

 {{< tip "warning">}}
 It is important to use the correct directory names, as the reasoner will seek to load specific files from each library.
 {{< /tip >}}

 Finally, install the reasoner itself by cloning the repository to a ~workflowfm/~ directory within HOL Light:
 #+BEGIN_SRC sh :eval no
 git clone https://github.com/workflowfm/workflowfm-reasoner.git worklfowfm
 #+END_SRC

